'use strict'
const randomStrings = ['abcdefg 4', 'abcdefg', 'bcd 1', 'bcId', 'aeaeaea 2', 'aeaeaea 2', '', '231', 'ad 32']
//========================================================================================================================================================
// Задача 1. Дано масив рядків. Вивести ті, у яких є цифри (використати метод test та регулярні вирази).

const res1 = randomStrings.filter(str => /\d/.test(str))
// const res1 = randomStrings.filter(str => /[0-9]/g.test(str))
console.log(res1)

//========================================================================================================================================================
// Задача 2. Дано масив рядків. Вивести ті, у яких немає цифр.

const res2 = randomStrings.filter(str => !/\d/.test(str))
// const res2 = randomStrings.filter(str => !/[0-9]/g.test(str))
console.log(res2)

//========================================================================================================================================================
// Задача 3. Дано масив рядків. Вивести ті, у яких є голосні літери.

const res3 = randomStrings.filter(str => /[aeiouy]/i.test(str))
console.log(res3)

//========================================================================================================================================================
// Задача 4. Дано масив рядків. Вивести ті, у яких немає голосних літер.

const res4 = randomStrings.filter(str => !/[aeiouy]/i.test(str))
console.log(res4)

//========================================================================================================================================================
// Задача 5. Дано масив рядків. Вивести ті, у яких є або цифра 1 або цифра 3.

const res5 = randomStrings.filter(str => /(1|3)/i.test(str))
console.log(res5)

//========================================================================================================================================================
const str = 'd4kl a 3 shj, dj 38 22 h!d 2 9md wwwd: aBcd  la 0- 21 jmes 0 aal;sd# 04.05.2023 das'
console.log(str)
//========================================================================================================================================================
// Задача 6. Дано рядок тексту, вивести усі числа, які є у тексті.

const digits = str.match(/[0-9]/g)
console.log(digits)

//========================================================================================================================================================
// Задача 7. Дано рядок тексту. Знайти усі знаки пунктуації, які були використано.

const symbols = str.match(/\W/g)
console.log(symbols)

//========================================================================================================================================================
// Задача 8. Дано рядок тексту. Вивести усі складові, які розділені розділовими знаками.
const test = str.match(/\w*[,:;-]\s\w+/gi)
console.log(test)
// не совсем понял задание но делал так:
// выводил все символы (цифры и буквы которые разделены знаком препинаия + пробелом)
// ааа bbb: ccc ddd 444, fff => вывожу ["bbb: ccc","444, fff"]

//========================================================================================================================================================
// Задача 9. Дано рядок тексту. Перевірити, чи містить він дату у форматі dd.mm.yyyy (dd- день, mm- місяць, yyyy- рік).

const isContainsDate = /\b\d{1,2}\.\d{1,2}\.\d{4}\b/.test(str)
console.log(isContainsDate)

//========================================================================================================================================================
// Задача 10. Дано рядок тексту. Підрахувати кількість двоцифрових чисел у рядку.

const numberOf2DigitNums = str.match(/\b\d{2}\b/g).length
console.log(numberOf2DigitNums)

//========================================================================================================================================================
const str2 = '4221-4325-3422-26343'
//========================================================================================================================================================
// Задача 11. Визначити чи може бути рядок тексту номером банківської картки (приклад: «4142-3433-2323-3434»). Знайти усі такі номери.
const isBankCard = /\b\d{4}-\d{4}-\d{4}-\d{4}\b/.test(str2)
console.log(`${str2} - is bank card? - ${isBankCard}`)

//========================================================================================================================================================
const site = 'https://eto-ne-gov-site.sovsem'
const site2 = 'https://www.kmu.gov.ua/'

//========================================================================================================================================================
// Задача 12. Дано адресу сайту. Визначити, чи є він урядовим (містить домен “gov”)
const regExpTemplate = /\.gov\./
const isGovSite = regExpTemplate.test(site)
console.log(`${site} - gov site? - ${isGovSite}`)
const isGovSite2 = regExpTemplate.test(site2)
console.log(`${site2} - gov site? - ${isGovSite2}`)

//========================================================================================================================================================
const years = 'kgkkgjs 2021 lsd 2093, ---!!! 2000, 2001, 2022, 2023 2055, 2034, sldak 2111'
//========================================================================================================================================================
// Задача 13. Вибрати усі роки після 2021 року з отриманого повідомлення

const yearsHigherThan2021 = years.match(/\b202[2-9]\b/g)
console.log(yearsHigherThan2021)

let yrs = years.match(/\b\d{4}\b/g)
yrs = yrs.filter(year => year > 2021)

//========================================================================================================================================================
const phoneNumb = '+58 038 38 3838'
//========================================================================================================================================================
// Задача 14. Дано номер телефону. Перевірити, чи є цей телефон телефоном з України (починаєтсья на «+38»)

const isUkrNumb = /^\+38/.test(phoneNumb)
console.log(`${phoneNumb} - is UKR number? - ${isUkrNumb}`)

//========================================================================================================================================================
let userName = '  Stepan Bandera'
console.log(userName)
//========================================================================================================================================================
// Задача 15. Користувач вводить прізвище та ім’я в одному рядку через пробіл.  Замінити пробіл на дефіс.
userName = userName.trim().replace(/\s/, '-')
// userName = userName.trim().replace(' ', '-')
console.log(userName)

//========================================================================================================================================================
let date = '17.04.2023'
console.log(date)
//========================================================================================================================================================
// Задача 16. Користувач вводить дату у форматі «день.місяць.рік». Отримати рядкове представлення дати у форматі «день/місяць/рік»
date = date.replaceAll('.', '/')
// date = date.replaceAll(/\./g, '/')
console.log(date)

//========================================================================================================================================================
// Задача 17. Користувач вводить день (номер дня (0-6) або «sun,mon,tue,wed,thu,fri,sat»). Визначити, чи  є це день вихідним

document.getElementById('inpd').addEventListener('change', function (e) {
	const val = e.target.value.toLowerCase()
	let msg
	if (/(^|\s)(0|6|sat|sun)($|\s)/.test(val)) {
		msg = 'Це вихідний день'
	} else if (/(^|\s)([1-5]|mon|tue|wed|thu|fri)($|\s)/.test(val)) {
		msg = 'Це робочий день'
	} else msg = 'Помилка вводу'
	document.querySelector('.res').innerText = msg
})
