'use strict'

//  Задача 1.
// Дано масив рядкових представлень чисел (тобто масив чисел у лапках (string).
// З використанням перевірки за допомогою регулярних виразів і груп підрахувати кількість тих, у яких перша і остання літери однакові.

const testArr = ['45', '323', '145', '1', '3', '4444', '53645645463546535', '1212', '5', '11']
console.log(testArr)

const regExp = /^(\d)\d*\1$/

const result = testArr.reduce((counter, str) => (regExp.test(str) ? counter + 1 : counter), 0)
console.log(result)

// Для наглядности
const testArr2 = []
testArr.forEach(str => {
	if (regExp.test(str)) testArr2.push(str)
})
console.log(testArr2)
//========================================================================================================================================================

// Задача 2. Замінити номер розділяючи послідовності цифр дефісом згідно з форматом 0 50 45 466 26 🡪 +380-50-45-466-26

let num = '0634585687'
console.log(num)
const regExp2 = /(\d)(\d{2})(\d{2})(\d{3})(\d{2})/

num = num.replace(regExp2, '+38$1-$2-$3-$4-$5')
console.log(num)
//========================================================================================================================================================

// Задача 3. Після кожного значення року після 2000 року додати «р.»
// «Я народився 2001, а в школі пішов 2007» 🡪 «Я народився 2001р., а в школі пішов 2007р.»

// после 2000 имелось ввиду что для годов <= 2000 не добавлять р.?
// const regExp4 = /(\d{4})/g

let str = '«Я народився 2000, пішов в садок у 2003, а в школу пішов 2007»'
const regExp3 = /(\d{3}[1-9])/g

str = str.replace(regExp3, '$1p.')

console.log(str)
//========================================================================================================================================================

// Задача 4. Вводиться велике число. Кожні 3 розряди відділяти пробілом.
// 7457896524 🡪 7 457 896 524

let num2 = '7457896524'
console.log(num2)

const regExp4 = /(\d{3})/g

num2 = num2.replace(regExp4, '$1 ')
console.log(num2)
